{
	"about": "I am a final year Computer Science student who loves to design application user interfaces, as well as develop web applications, both frontend and backend. I specialize in developing web applications using frameworks such as React and Node.",
	"email": "andrehanjaya9@gmail.com",
	"phone": "+60-166933058",
	"linkedin": "https://www.linkedin.com/in/andrehanjaya9/",
	"github": "https://github.com/andrehhh",
	"whatsapp": "https://wa.link/c5m89f",
	"facebook": "#",
	"instagram": "https://www.instagram.com/dredre_02/",
	"twitter": "#",

	"projects": [
		{
			"name": "My Portfolio V2",
			"githubLink": "https://github.com/andrehhh/my-portfolio-react",
			"link": "",
			"skills": ["html", "css", "javascript", "react", "sass", "git"],
			"image": "https://i.ibb.co/QPLnvf8/Screenshot-2021-06-29-at-2-59-13-PM.png",
			"desc": [
				"My second version of my personal portfolio which is fully responsive for both tablets and mobile phones. It is built on React.js and Sass, and the UI/UX design is developed with Figma.",
				"Implemented array manipulation technique like map, as well as using hooks such as useState, useEffect, and useContext. The projects section is mapped from a json file, which is fully dynamic."
			]
		},
		{
			"name": "Air and Sound Pollution Monitoring System",
			"githubLink": "https://github.com/andrehhh/air_and_sound_monitoring_system",
			"link": "",
			"skills": ["html", "css", "javascript", "node", "express", "mongo", "git"],
			"image": "https://i.ibb.co/FXNsF9C/Air-And-Sound-Pollution-Screenshot.png",
			"desc": [
				"An arduino-based project that consists of an Arduino device alongside multiple ambient and gas sensors that enables users to collect environmental data such as temperature, humidity, and air quality score and view it in real time from the web browser.",
				"I used a cloud VM that hosts a Node and Express backend that handles the data from the arduino and saves it into a mongoDB database. The data is collected from the DB is then shown on the web browsers using vanilla HTML & CSS, and I also used Plotly.js to plot line charts"
			]
		}, 
		{
			"name": "Water Sedimentation Analysis",
			"githubLink": "https://github.com/mfikryrizal/RiverApp",
			"link": "",
			"skills": ["python", "flask"],
			"image": "https://i.ibb.co/FXNsF9C/Air-And-Sound-Pollution-Screenshot.png",
			"desc": [
				"This project enables users to measure the water sedimentation level by taking a picture with their mobile phones. I am responsible of handling the backend system of this project.",
				"I used Python’s Flask and other libraries such as pandas for csv manipulation, and boto3 for connecting our flask backend with AWS's S3 bucket database in order to save the results of the analysis."
			]
		}
	]
}